IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-Integer.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 CH PIC X.
    77 DIGIT  BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-JSON    PIC X ANY LENGTH.
    01 LK-OFFSET  BINARY-LONG UNSIGNED.
    01 LK-FAILURE BINARY-CHAR UNSIGNED.
    01 LK-NUM     BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE LK-NUM.
    MOVE 0 TO LK-FAILURE.
    MOVE 0 TO LK-NUM.
    PERFORM SKIP-SPACES.

    PERFORM UNTIL LK-OFFSET > FUNCTION LENGTH(LK-JSON)
        MOVE LK-JSON(LK-OFFSET:1) TO CH
        IF CH < '0' OR CH > '9'
            EXIT PERFORM
        END-IF
        COMPUTE DIGIT = FUNCTION ORD(CH) - FUNCTION ORD('0')
        COMPUTE LK-NUM = (LK-NUM * 10) + DIGIT
        ADD 1 TO LK-OFFSET
    END-PERFORM.
    GOBACK.

SKIP-SPACES.
    PERFORM UNTIL LK-OFFSET > FUNCTION LENGTH(LK-JSON)
        MOVE LK-JSON(LK-OFFSET:1) TO CH
        IF CH NOT = SPACE AND CH NOT = X"09" AND CH NOT = X"0A" AND CH NOT = X"0D"
            EXIT PERFORM
        END-IF
        ADD 1 TO LK-OFFSET
    END-PERFORM.
    EXIT.

END PROGRAM JsonParse-Integer.

