IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-ObjectKey.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 CH PIC X.
    77 I  BINARY-LONG UNSIGNED.
    77 KEY-LEN BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-JSON    PIC X ANY LENGTH.
    01 LK-OFFSET  BINARY-LONG UNSIGNED.
    01 LK-FAILURE BINARY-CHAR UNSIGNED.
    01 LK-KEY     PIC X ANY LENGTH.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE LK-KEY.
    MOVE 0 TO LK-FAILURE.
    MOVE FUNCTION LENGTH(LK-KEY) TO KEY-LEN.
    PERFORM SKIP-SPACES.
    IF LK-JSON(LK-OFFSET:1) NOT = '"'
        MOVE 1 TO LK-FAILURE
        GOBACK
    END-IF.
    ADD 1 TO LK-OFFSET.

    MOVE SPACES TO LK-KEY.
    MOVE 0 TO I.
    PERFORM UNTIL LK-OFFSET > FUNCTION LENGTH(LK-JSON)
        MOVE LK-JSON(LK-OFFSET:1) TO CH
        IF CH = '"'
            ADD 1 TO LK-OFFSET
            EXIT PERFORM
        END-IF
        ADD 1 TO I
        IF I <= KEY-LEN
            MOVE CH TO LK-KEY(I:1)
        END-IF
        ADD 1 TO LK-OFFSET
    END-PERFORM.

    PERFORM SKIP-SPACES.
    IF LK-JSON(LK-OFFSET:1) = ":"
        ADD 1 TO LK-OFFSET
    ELSE
        MOVE 1 TO LK-FAILURE
    END-IF.
    GOBACK.

SKIP-SPACES.
    PERFORM UNTIL LK-OFFSET > FUNCTION LENGTH(LK-JSON)
        MOVE LK-JSON(LK-OFFSET:1) TO CH
        IF CH NOT = SPACE AND CH NOT = X"09" AND CH NOT = X"0A" AND CH NOT = X"0D"
            EXIT PERFORM
        END-IF
        ADD 1 TO LK-OFFSET
    END-PERFORM.
    EXIT.

END PROGRAM JsonParse-ObjectKey.

