IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-ArrayEnd.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 CH PIC X.
LINKAGE SECTION.
    01 LK-JSON    PIC X ANY LENGTH.
    01 LK-OFFSET  BINARY-LONG UNSIGNED.
    01 LK-FAILURE BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE.
    MOVE 0 TO LK-FAILURE.
    PERFORM SKIP-SPACES.
    IF LK-JSON(LK-OFFSET:1) = "]"
        ADD 1 TO LK-OFFSET
    ELSE
        MOVE 1 TO LK-FAILURE
    END-IF.
    GOBACK.

SKIP-SPACES.
    PERFORM UNTIL LK-OFFSET > FUNCTION LENGTH(LK-JSON)
        MOVE LK-JSON(LK-OFFSET:1) TO CH
        IF CH NOT = SPACE AND CH NOT = X"09" AND CH NOT = X"0A" AND CH NOT = X"0D"
            EXIT PERFORM
        END-IF
        ADD 1 TO LK-OFFSET
    END-PERFORM.
    EXIT.

END PROGRAM JsonParse-ArrayEnd.

