IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-String.

DATA DIVISION.

PROCEDURE DIVISION.
    DISPLAY "hello"
    GOBACK.

END PROGRAM JsonParse-String.
