IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-SkipValue.

DATA DIVISION.
LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-FAILURE              BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE.
    MOVE 0 TO LK-FAILURE.
    GOBACK.
END PROGRAM JsonParse-SkipValue.

