IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-ObjectKey.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MILLION                 BINARY-LONG UNSIGNED VALUE 1000000.
01 MODE                    BINARY-LONG UNSIGNED.
01 COUNT                   BINARY-LONG UNSIGNED.

LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-FAILURE              BINARY-CHAR UNSIGNED.
01 LK-KEY                  PIC X ANY LENGTH.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE LK-KEY.
    DIVIDE LK-OFFSET BY MILLION GIVING MODE REMAINDER COUNT.

    EVALUATE MODE
        WHEN 0
            MOVE "block" TO LK-KEY
            COMPUTE LK-OFFSET = 1000000 + COUNT
        WHEN 1
            MOVE "definition" TO LK-KEY
            COMPUTE LK-OFFSET = 2000000 + COUNT
        WHEN 2
            MOVE "type" TO LK-KEY
        WHEN OTHER
            MOVE "x" TO LK-KEY
    END-EVALUATE.

    MOVE 0 TO LK-FAILURE.
    GOBACK.
END PROGRAM JsonParse-ObjectKey.

