IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-ObjectStart.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MILLION                 BINARY-LONG UNSIGNED VALUE 1000000.
01 MODE                    BINARY-LONG UNSIGNED.
01 COUNT                   BINARY-LONG UNSIGNED.

LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-FAILURE              BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE.
    DIVIDE LK-OFFSET BY MILLION GIVING MODE REMAINDER COUNT.
    IF LK-OFFSET = 1
        MOVE 0 TO LK-OFFSET
    END-IF.
    MOVE 0 TO LK-FAILURE.
    GOBACK.
END PROGRAM JsonParse-ObjectStart.

