IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-String.

DATA DIVISION.
LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-FAILURE              BINARY-CHAR UNSIGNED.
01 LK-OUT                  PIC X ANY LENGTH.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE LK-OUT.
    MOVE 0 TO LK-FAILURE.
    MOVE "dummy" TO LK-OUT.
    GOBACK.
END PROGRAM JsonParse-String.

