IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-Comma.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-BLOCKS.
01 MILLION                 BINARY-LONG UNSIGNED VALUE 1000000.
01 MODE                    BINARY-LONG UNSIGNED.
01 COUNT                   BINARY-LONG UNSIGNED.

LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-EXIT-LOOP            BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-EXIT-LOOP.
    DIVIDE LK-OFFSET BY MILLION GIVING MODE REMAINDER COUNT.

    EVALUATE MODE
        WHEN 0
            ADD 1 TO COUNT
            IF COUNT < BLOCKS-CAPACITY
                MOVE 0 TO LK-EXIT-LOOP
            ELSE
                MOVE 1 TO LK-EXIT-LOOP
            END-IF
            COMPUTE LK-OFFSET = MODE * MILLION + COUNT
        WHEN OTHER
            MOVE 1 TO LK-EXIT-LOOP
    END-EVALUATE.

    GOBACK.
END PROGRAM JsonParse-Comma.

