IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-ObjectEnd.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MILLION                 BINARY-LONG UNSIGNED VALUE 1000000.
01 MODE                    BINARY-LONG UNSIGNED.
01 COUNT                   BINARY-LONG UNSIGNED.

LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-FAILURE              BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE.
    DIVIDE LK-OFFSET BY MILLION GIVING MODE REMAINDER COUNT.

    EVALUATE MODE
        WHEN 1
            COMPUTE LK-OFFSET = COUNT
            MOVE 0 TO LK-FAILURE
        WHEN 0
            MOVE 1 TO LK-FAILURE
        WHEN OTHER
            MOVE 0 TO LK-FAILURE
    END-EVALUATE.

    GOBACK.
END PROGRAM JsonParse-ObjectEnd.

