IDENTIFICATION DIVISION.
PROGRAM-ID. JsonParse-Boolean.

DATA DIVISION.
LINKAGE SECTION.
01 LK-JSON                 PIC X ANY LENGTH.
01 LK-OFFSET               BINARY-LONG UNSIGNED.
01 LK-FAILURE              BINARY-CHAR UNSIGNED.
01 LK-OUT                  BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-JSON LK-OFFSET LK-FAILURE LK-OUT.
    MOVE 0 TO LK-FAILURE.
    MOVE 0 TO LK-OUT.
    GOBACK.
END PROGRAM JsonParse-Boolean.

