IDENTIFICATION DIVISION.
PROGRAM-ID. Main-Blocks-Parse-TC-6.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT RESULT-FILE ASSIGN TO WS-RESULT-FILE-PATH
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD RESULT-FILE.
01 RESULT-REC PIC X(256).

WORKING-STORAGE SECTION.
    COPY DD-BLOCKS.

    01 LK-JSON            PIC X(4096) VALUE SPACES.
    01 LK-JSON-LEN        BINARY-LONG UNSIGNED VALUE 0.
    01 LK-FAILURE         BINARY-CHAR UNSIGNED VALUE 0.

    01 NAME-MATCH         BINARY-CHAR UNSIGNED VALUE 0.

    01 OUTPUT-LINE        PIC X(256) VALUE SPACES.
    01 WS-RESULT-FILE-PATH PIC X(260).

    01 LK-FAILURE-DISPLAY                     PIC 9(10).
    01 BLOCK-COUNT-DISPLAY                    PIC 9(10).
    01 BLOCK-ENTRY-PROPERTY-COUNT-1-DISPLAY   PIC 9(10).
    01 NAME-MATCH-DISPLAY                     PIC 9(10).

PROCEDURE DIVISION.
    DISPLAY "Main-Blocks-Parse-TC-6 started".

    ACCEPT WS-RESULT-FILE-PATH FROM ENVIRONMENT "RESULT_FILE_PATH".

    ACCEPT LK-JSON     FROM ENVIRONMENT "LK-JSON".
    ACCEPT LK-JSON-LEN FROM ENVIRONMENT "LK-JSON-LEN".
    ACCEPT LK-FAILURE  FROM ENVIRONMENT "LK-FAILURE".

    INITIALIZE BLOCKS.

    CALL "Blocks-Parse" USING LK-JSON LK-JSON-LEN LK-FAILURE.

    IF BLOCK-ENTRY-NAME(1) = "minecraft:complex"
        MOVE 1 TO NAME-MATCH
    ELSE
        MOVE 0 TO NAME-MATCH
    END-IF
    .

    OPEN OUTPUT RESULT-FILE.

    MOVE LK-FAILURE TO LK-FAILURE-DISPLAY.
    STRING "LK-FAILURE=" DELIMITED BY SIZE
           LK-FAILURE-DISPLAY DELIMITED BY SIZE
           INTO OUTPUT-LINE
    END-STRING
    MOVE OUTPUT-LINE TO RESULT-REC
    WRITE RESULT-REC

    MOVE BLOCK-COUNT TO BLOCK-COUNT-DISPLAY.
    STRING "BLOCK-COUNT=" DELIMITED BY SIZE
           BLOCK-COUNT-DISPLAY DELIMITED BY SIZE
           INTO OUTPUT-LINE
    END-STRING
    MOVE OUTPUT-LINE TO RESULT-REC
    WRITE RESULT-REC

    MOVE BLOCK-ENTRY-PROPERTY-COUNT(1) TO BLOCK-ENTRY-PROPERTY-COUNT-1-DISPLAY.
    STRING "BLOCK-ENTRY-PROPERTY-COUNT-1=" DELIMITED BY SIZE
           BLOCK-ENTRY-PROPERTY-COUNT-1-DISPLAY DELIMITED BY SIZE
           INTO OUTPUT-LINE
    END-STRING
    MOVE OUTPUT-LINE TO RESULT-REC
    WRITE RESULT-REC

    MOVE NAME-MATCH TO NAME-MATCH-DISPLAY.
    STRING "NAME-MATCH=" DELIMITED BY SIZE
           NAME-MATCH-DISPLAY DELIMITED BY SIZE
           INTO OUTPUT-LINE
    END-STRING
    MOVE OUTPUT-LINE TO RESULT-REC
    WRITE RESULT-REC

    CLOSE RESULT-FILE.

    GOBACK.
END PROGRAM Main-Blocks-Parse-TC-6.

